**NOV 26**

**Step-1: Import packages**

In [1]:
import pandas as pd   # data frames / data bases
import numpy as np   # maths
import matplotlib.pyplot as plt # graphs and visualization
import seaborn as sns # visualization

**Step-2 : Create a DataFrame using a list**

In [2]:
names=['Ramesh','Suresh','Sathish']
# pd.DataFrame(data,index,columns)
pd.DataFrame(names)

         0
0   Ramesh
1   Suresh
2  Sathish

**Step-3: I want to change the Index**

In [4]:
names=['Ramesh','Suresh','Sathish']
# pd.DataFrame(data,index,columns)
ids=['A','B','C']
pd.DataFrame(names,ids)

         0
A   Ramesh
B   Suresh
C  Sathish

**Step-4: Add the columns**

In [5]:
names=['Ramesh','Suresh','Sathish']
ids=['A','B','C']
cols=['Names']
pd.DataFrame(names,ids,cols)

     Names
A   Ramesh
B   Suresh
C  Sathish

In [11]:
names=['Ramesh','Suresh','Sathish']
ids=['1','2','3']
cols=['Names']
pd.DataFrame(names,ids,cols)

     Names
1   Ramesh
2   Suresh
3  Sathish

In [3]:
names=['Ramesh','Suresh','Sathish']
cols=['Names']
pd.DataFrame(names,cols)

ValueError: Shape of passed values is (3, 1), indices imply (1, 1)

**Step-5: Data and Columns**

In [10]:
names=['Ramesh','Suresh','Sathish']
cols=['Names']
pd.DataFrame(names,columns=cols)  # probides the argument name

     Names
0   Ramesh
1   Suresh
2  Sathish

**Step-6: Multiple Columns**

In [14]:
names=['Ramesh','Suresh','Sathish']
age=[20,22,24]
pd.DataFrame(zip(names,age))

         0   1
0   Ramesh  20
1   Suresh  22
2  Sathish  24

In [3]:
import pandas as pd
names=['Ramesh','Suresh','Sathish']
age=[20,22,24]
cols=['names','age']
pd.DataFrame(zip(names,age),columns=cols)

     names  age
0   Ramesh   20
1   Suresh   22
2  Sathish   24

**Step-7: Add a new column to already existed DataFrame(df)**

- in above first we have taken data
- then created a DataFrame
- now we want to add the new data based on requirements

In [4]:
names=['Ramesh','Suresh','Sathish']
age=[20,22,24]
cols=['names','age']
df=pd.DataFrame(zip(names,age),columns=cols)

df

     names  age
0   Ramesh   20
1   Suresh   22
2  Sathish   24

In [5]:
names=['Ramesh','Suresh','Sathish']
age=[20,22,24]
ids=['A','B','C']
cols=['names','age']
df=pd.DataFrame(zip(names,age),ids,cols)

df

     names  age
A   Ramesh   20
B   Suresh   22
C  Sathish   24

In [6]:
city=['Hyd','Pune','Blr']
city[0]

'Hyd'

In [7]:
city=['Hyd','Pune','Blr']
df['City']=city
df

     names  age  City
A   Ramesh   20   Hyd
B   Suresh   22  Pune
C  Sathish   24   Blr

In [8]:
city=['Hyd','Pune','Blr']
df['Country']=city
df

     names  age  City Country
A   Ramesh   20   Hyd     Hyd
B   Suresh   22  Pune    Pune
C  Sathish   24   Blr     Blr

In [28]:
df['marks']=[20,30]

ValueError: Length of values (2) does not match length of index (3)

In [9]:
df['marks']=[20,30,40]
df

     names  age  City Country  marks
A   Ramesh   20   Hyd     Hyd     20
B   Suresh   22  Pune    Pune     30
C  Sathish   24   Blr     Blr     40

**Step-8: Update the columns with new values**

In [10]:
df['marks']

A    20
B    30
C    40
Name: marks, dtype: int64

In [11]:
city=['Hyd','Pune','Blr']
df['City']=city
df['marks']=[200,300,400]

In [12]:
df

     names  age  City Country  marks
A   Ramesh   20   Hyd     Hyd    200
B   Suresh   22  Pune    Pune    300
C  Sathish   24   Blr     Blr    400

**Step-9: Create empty DataFrame and add the columns**

In [13]:
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [14]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Sathish']
df['Age']=[20,30,40]
df['City']=['Hyd','Pune','Blr']
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   30  Pune
2  Sathish   40   Blr

**Step-10: Create the DataFrame using Dictionary**

In [15]:
d={'Names':['Ramesh','Suresh','Sathish'],
   'Age':[20,30,40],
   'City':['Hyd','Pune','Blr']}
d

{'Names': ['Ramesh', 'Suresh', 'Sathish'],
 'Age': [20, 30, 40],
 'City': ['Hyd', 'Pune', 'Blr']}

In [16]:
d={'Names':['Ramesh','Suresh','Sathish'],
   'Age':[20,30,40],
   'City':['Hyd','Pune','Blr']}
df=pd.DataFrame(d)
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   30  Pune
2  Sathish   40   Blr

In [17]:
d={'Names':'Ramesh',
   'Age':20,
   'City':'Hyd'}     # Data should be in list Square braces
df=pd.DataFrame(d)
df

ValueError: If using all scalar values, you must pass an index

In [18]:
d={'Names':'Ramesh',
   'Age':20,
   'City':'Hyd'}     # Data should be in list Square braces and you must pass an index
df=pd.DataFrame(d,index=[0])
df

    Names  Age City
0  Ramesh   20  Hyd

In [19]:
d={'Names':'Ramesh',
   'Age':20,
   'City':'Hyd'}     
df=pd.DataFrame(d,index=[100])
df

      Names  Age City
100  Ramesh   20  Hyd

In [20]:
d={'Names':['Ramesh'],
   'Age':[20],
   'City':['Hyd']}
df=pd.DataFrame(d)
df

    Names  Age City
0  Ramesh   20  Hyd

**Step-11: Save the DataFrame**

In [21]:
#file handling sessions
# directory//filename.ext
# filename.ext
# we are saving dataframes 
#   .csv or .xlsx

df.to_csv('data.Csv')

In [42]:
df.to_csv(r'C:\Users\SANGEETHA\Documents\Numpy')

PermissionError: [Errno 13] Permission denied: 'C:\\Users\\SANGEETHA\\Documents\\Numpy'

In [34]:
df.to_excel('data.xlsx')

**NOV 27**

**Step-12: How to read the Dataframe**

In [24]:
import pandas as pd   
import numpy as np   
import matplotlib.pyplot as plt 
import seaborn as sns

In [27]:
d={'Names':['Ramesh','Suresh','Sathish'],
   'Age':[20,30,40],
   'City':['Hyd','Pune','Blr']}
df=pd.DataFrame(d)
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   30  Pune
2  Sathish   40   Blr

In [30]:
# in order to read the data
# filename.ext
# open(mbox-short.txt).read()
# open(dummy.txt,mode write('hello')

# data.csv

pd.read_csv('data.csv')

   Unnamed: 0   Names  Age City
0           0  Ramesh   20  Hyd

In [35]:
pd.read_excel('data.xlsx')

   Unnamed: 0    Names  Age  City
0           0   Ramesh   20   Hyd
1           1   Suresh   30  Pune
2           2  Sathish   40   Blr

In [29]:
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   30  Pune
2  Sathish   40   Blr

In [ ]:
df.to_csv
pd.read_csv

df.to_excel
pd.read_excel

In [36]:
df.to_csv('data1.csv',index=False)

In [37]:
pd.read_csv('data1.csv')

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   30  Pune
2  Sathish   40   Blr

In [39]:
df.to_excel('data1.xlsx',index=False)

In [41]:
pd.read_excel('data1.xlsx')

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   30  Pune
2  Sathish   40   Blr

In [ ]:
# add one more column marks to df

In [44]:
d={'Names':['Ramesh','Suresh','Sathish'],
   'Age':[20,30,40],
   'City':['Hyd','Pune','Blr'],
   'Marks':[20,22,45]}
df=pd.DataFrame(d)
df

     Names  Age  City  Marks
0   Ramesh   20   Hyd     20
1   Suresh   30  Pune     22
2  Sathish   40   Blr     45

In [ ]:
df['marks']=[

**Step-13: Drop the column**

- labels: 'IndexLabel | None' = None :
  - 
- axis: 'Axis' = 0,
  -
- index: 'IndexLabel | None' = None,
  - 
- columns: 'IndexLabel | None' = None, 
- level: 'Level | None' = None,
- inplace: 'bool' = False,

In [46]:
df.drop()

<bound method DataFrame.drop of      Names  Age  City  Marks
0   Ramesh   20   Hyd     20
1   Suresh   30  Pune     22
2  Sathish   40   Blr     45>

In [54]:
df.drop(index=1)

     Names  Age City  Marks
0   Ramesh   20  Hyd     20
2  Sathish   40  Blr     45

In [56]:
df.drop(columns='Marks')

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   30  Pune
2  Sathish   40   Blr

In [ ]:
df.drop(index=1)
df.drop(columns='Marks')
# ========================================
df.drop('Marks')  # i fi dont give argument lable
df.drop(1)  # 1 become label
# ========================================
# we need to provide axis
# axis=0 indicates index
# axis=1 indicates columns

In [60]:
df.drop('Marks',axis=0)

KeyError: "['Marks'] not found in axis"

In [59]:
df.drop('Marks',axis=1)

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   30  Pune
2  Sathish   40   Blr

**inplace**

- when we do the operation the result output is not overwriting 
- means the original dataframe is same as it is.
- in order to do this we need use **inplace**
- by default inplace=False
- make **inplace = True** if you want overwrite the result

In [62]:
df.drop('Marks',axis=1,inplace=True)

In [63]:
df

     Names  Age  City
0   Ramesh   20   Hyd
1   Suresh   30  Pune
2  Sathish   40   Blr

**Step-14: Rename the column**

In [70]:
d={'City':'city'}  # {old : new}
df.rename(mapper=d,axis=1,inplace=True)
df

     Names  Age  city
0   Ramesh   20   Hyd
1   Suresh   30  Pune
2  Sathish   40   Blr

In [72]:
d={'City':'city'}  # {old : new}
# df.rename(<mapper>,<axis>,<inplace>=)

df.rename(d,axis=1,inplace=True)
df

     Names  Age  city
0   Ramesh   20   Hyd
1   Suresh   30  Pune
2  Sathish   40   Blr

In [77]:
d={2:'B'}
df.rename(d,axis=0,inplace=True)
df

     Names  Age  city
0   Ramesh   20   Hyd
1   Suresh   30  Pune
B  Sathish   40   Blr

In [ ]:
## Create one more df
# x=1 to 10
# y=square x
# z= cube of x

In [79]:
x=list(range(1,11))
y=[i*i for i in x]
z=[i**3 for i in x]

df=pd.DataFrame(zip(x,y,z),
                columns=['x','y','z'])
df

    x    y     z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

- len 
- shape : df.shape
- size : df.size
- head : df.head
- tail : df.tail
- isnull : df.isnull
- dtypes : df.dtypes
- info : df.info

In [91]:
len(df)

10

In [83]:
df.shape

(10, 3)

In [84]:
df.size

30

In [98]:
df.head()

   x   y    z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125

In [97]:
df.tail()

    x    y     z
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [92]:
df.isnull()

       x      y      z
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False

In [94]:
df.isnull().sum()

x    0
y    0
z    0
dtype: int64

In [96]:
df.dtypes

# if any categorical cols occus 
# it represents as object
# int===int64
# float

x    int64
y    int64
z    int64
dtype: object

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       10 non-null     int64
 1   y       10 non-null     int64
 2   z       10 non-null     int64
dtypes: int64(3)
memory usage: 372.0 bytes

**Step-15: Select a columns**

In [99]:
df.columns

Index(['x', 'y', 'z'], dtype='object')

In [105]:
df['x'] # signle list indictses scalar value series and 1D series means no names

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: x, dtype: int64

In [106]:
df[['x','y']]  # names indicates dataframes # 2 list always dataframe represents 2D

    x    y
0   1    1
1   2    4
2   3    9
3   4   16
4   5   25
5   6   36
6   7   49
7   8   64
8   9   81
9  10  100

In [110]:
type(df['x'])  #1D

pandas.core.series.Series

In [111]:
type(df[['x','y']]) #2D

pandas.core.frame.DataFrame

In [112]:
df['x'].shape

(10,)

In [113]:
df[['x','y']].shape

(10, 2)

In [116]:
df

    x    y     z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [114]:
df['x'].size

10

In [115]:
df[['x','y']].size

20

In [117]:
df  # entire dataframe
df['x'] # selecting one particular column 
df['x'].values  # extracting the data

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [118]:
df  # entire dataframe
df['z'] # selecting one particular column 
df['z'].values  # extracting the data

array([   1,    8,   27,   64,  125,  216,  343,  512,  729, 1000])

In [121]:
df  # entire dataframe
df['z'] # selecting one particular column 
df['z'].values
df['z'].values.tolist()  # only list will come

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

In [122]:
df
df[['y','z']]

     y     z
0    1     1
1    4     8
2    9    27
3   16    64
4   25   125
5   36   216
6   49   343
7   64   512
8   81   729
9  100  1000

In [123]:
df
df[['y','z']]
df[['y','z']].values

array([[   1,    1],
       [   4,    8],
       [   9,   27],
       [  16,   64],
       [  25,  125],
       [  36,  216],
       [  49,  343],
       [  64,  512],
       [  81,  729],
       [ 100, 1000]])